ERP_DZGU_EXTENTION/DataProcessors/БИТ_АРМПоКонтролюКачества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>БИТ_АРМПоКонтролюКачества</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СертификацияНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выб</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокНаСкладе</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокНаКарантине</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сертифицировано</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокВПалетах</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КарантинВПалетах</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СертифицированоВПалетах</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдИзм</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КОформлению</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отказ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдостоверениеКачества</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНоменклатуры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Склады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

ERP_DZGU_EXTENTION/AccumulationRegisters/ТоварыОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыОрганизаций</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаНоменклатуры</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗапасов</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ERP_DZGU_EXTENTION/AccumulationRegisters/РезервыТоваровОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>РезервыТоваровОрганизаций</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаНоменклатуры</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗапасов</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ERP_DZGU_EXTENTION/AccumulationRegisters/БИТ_Карантин.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>БИТ_Карантин</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ERP_DZGU_EXTENTION/AccumulationRegisters/БИТ_СертификацияОстатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>БИТ_СертификацияОстатки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ERP_DZGU_EXTENTION/AccumulationRegisters/БИТ_ОтказСертификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>БИТ_ОтказСертификации</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ERP_DZGU_EXTENTION/InformationRegisters/БИТ_УдостоверенияНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>БИТ_УдостоверенияНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УдостоверениеКачества</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERP_DZGU_EXTENTION/Enums/БИТ_ОтборВАРМКонтрольКачества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>БИТ_ОтборВАРМКонтрольКачества</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыводитьВсе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Карантин</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выпуск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ERP_DZGU_EXTENTION/DataProcessors/БИТ_АРМПоКонтролюКачества/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
    ЗаполнитьТЧ();
    ОтборВТЗНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
    ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СертификацияНоменклатурыКОформлениюПриИзменении(Элемент)
    ТекСтр = Элементы.СертификацияНоменклатуры.ТекущиеДанные;
    Если ТекСтр.КОформлению <> 0  Тогда
        ТекСтр.Выб = Истина;
    Иначе
        ТекСтр.Выб = Ложь;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
    МассивСертификаций = ЗаполнитьСертификациюСрв();	
    Для каждого стр из МассивСертификаций Цикл 
        ПараметрыФормы = Новый Структура("Основание", стр);
        ОткрытьФорму("Документ.БИТ_СертификацияНоменклатуры.ФормаОбъекта",ПараметрыФормы,,Новый УникальныйИдентификатор());
    КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСертификациюСрв()
    МассивСертификаций = Новый Массив;
    Для каждого стр из Объект.СертификацияНоменклатуры Цикл
        Если стр.Выб Тогда
            ДокСертификация = Документы.БИТ_СертификацияНоменклатуры.СоздатьДокумент();
            СтруктураЗаполнения = Новый Структура;
            СтруктураЗаполнения.Вставить("Номенклатура",стр.Номенклатура);
            СтруктураЗаполнения.Вставить("Серия",стр.Серия);
            СтруктураЗаполнения.Вставить("Количество",стр.КОформлению);
            СтруктураЗаполнения.Вставить("Склад",стр.Склад);
            СтруктураЗаполнения.Вставить("Организация",Объект.Организация);
            
            МассивСертификаций.Добавить(СтруктураЗаполнения);
            
        КонецЕсли;
    КонецЦикла;
    Возврат МассивСертификаций;
КонецФункции

&НаКлиенте
Процедура Заполнить(Команда)
    ЗаполнитьТЧ();
    ОтборВТЗНаСервере();
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьТЧ()
    СкрытьПоказатьКолонкуСклад();
    Объект.СертификацияНоменклатуры.Очистить();
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	Остатки.Номенклатура КАК Номенклатура,
    |	Остатки.Серия КАК Серия,
    |	Остатки.Склад КАК Склад,
    |	СУММА(Остатки.КоличествоОстаток) КАК КоличествоОстаток
    |ПОМЕСТИТЬ Остатки
    |ИЗ
    |	(ВЫБРАТЬ
    |		Остатки.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
    |		Остатки.АналитикаУчетаНоменклатуры.Серия КАК Серия,
    |		Остатки.АналитикаУчетаНоменклатуры.МестоХранения КАК Склад,
    |		СУММА(Остатки.КоличествоОстаток) КАК КоличествоОстаток
    |	ИЗ
    |		РегистрНакопления.ТоварыОрганизаций.Остатки(
    |				,
    |				Организация = &Организация
    |					И АналитикаУчетаНоменклатуры.МестоХранения В (&Склады)
    |					И АналитикаУчетаНоменклатуры.Номенклатура.БИТ_ТребуетсяВнутренняяСертификация) КАК Остатки
    |	ГДЕ
    |		НЕ Остатки.АналитикаУчетаНоменклатуры.Номенклатура.ПодакцизныйТовар
    |	
    |	СГРУППИРОВАТЬ ПО
    |		Остатки.АналитикаУчетаНоменклатуры.Номенклатура,
    |		Остатки.АналитикаУчетаНоменклатуры.Серия,
    |		Остатки.АналитикаУчетаНоменклатуры.МестоХранения
    |	
    |	ОБЪЕДИНИТЬ ВСЕ
    |	
    |	ВЫБРАТЬ
    |		Остатки.АналитикаУчетаНоменклатуры.Номенклатура,
    |		Остатки.АналитикаУчетаНоменклатуры.Серия,
    |		Остатки.АналитикаУчетаНоменклатуры.МестоХранения,
    |		СУММА(Остатки.КоличествоОстаток)
    |	ИЗ
    |		РегистрНакопления.РезервыТоваровОрганизаций.Остатки(
    |				,
    |				Организация = &Организация
    |					И АналитикаУчетаНоменклатуры.МестоХранения В (&Склады)
    |					И АналитикаУчетаНоменклатуры.Номенклатура.БИТ_ТребуетсяВнутренняяСертификация) КАК Остатки
    |	ГДЕ
    |		НЕ Остатки.АналитикаУчетаНоменклатуры.Номенклатура.ПодакцизныйТовар
    |	
    |	СГРУППИРОВАТЬ ПО
    |		Остатки.АналитикаУчетаНоменклатуры.Номенклатура,
    |		Остатки.АналитикаУчетаНоменклатуры.Серия,
    |		Остатки.АналитикаУчетаНоменклатуры.МестоХранения) КАК Остатки
    |
    |СГРУППИРОВАТЬ ПО
    |	Остатки.Номенклатура,
    |	Остатки.Серия,
    |	Остатки.Склад
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	БИТ_КарантинОстатки.Номенклатура КАК Номенклатура,
    |	БИТ_КарантинОстатки.Серия КАК Серия,
    |	БИТ_КарантинОстатки.Склад КАК Склад,
    |	БИТ_КарантинОстатки.КоличествоОстаток КАК КоличествоОстаток
    |ПОМЕСТИТЬ ВТ_Карантин
    |ИЗ
    |	РегистрНакопления.БИТ_Карантин.Остатки(
    |			,
    |			Организация = &Организация
    |				И Склад В (&Склады)) КАК БИТ_КарантинОстатки
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	БИТ_СертификацияОстаткиОстатки.Номенклатура КАК Номенклатура,
    |	БИТ_СертификацияОстаткиОстатки.Серия КАК Серия,
    |	БИТ_СертификацияОстаткиОстатки.Склад КАК Склад,
    |	БИТ_СертификацияОстаткиОстатки.КоличествоОстаток КАК КоличествоОстаток
    |ПОМЕСТИТЬ ВТ_Сертификация
    |ИЗ
    |	РегистрНакопления.БИТ_СертификацияОстатки.Остатки(
    |			,
    |			Организация = &Организация
    |				И Склад В (&Склады)) КАК БИТ_СертификацияОстаткиОстатки
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	БИТ_ОтказСертификацииОстатки.Номенклатура КАК Номенклатура,
    |	БИТ_ОтказСертификацииОстатки.Серия КАК Серия,
    |	БИТ_ОтказСертификацииОстатки.Склад КАК Склад,
    |	БИТ_ОтказСертификацииОстатки.КоличествоОстаток КАК КоличествоОстаток
    |ПОМЕСТИТЬ ВТ_Отказ
    |ИЗ
    |	РегистрНакопления.БИТ_ОтказСертификации.Остатки(
    |			,
    |			Организация = &Организация
    |				И Склад В (&Склады)) КАК БИТ_ОтказСертификацииОстатки
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	БИТ_УдостоверенияНоменклатуры.Номенклатура КАК Номенклатура,
    |	БИТ_УдостоверенияНоменклатуры.Серия КАК Серия,
    |	БИТ_УдостоверенияНоменклатуры.УдостоверениеКачества КАК УдостоверениеКачества
    |ПОМЕСТИТЬ ВТ_Удотоверения
    |ИЗ
    |	РегистрСведений.БИТ_УдостоверенияНоменклатуры КАК БИТ_УдостоверенияНоменклатуры
    |ГДЕ
    |	(БИТ_УдостоверенияНоменклатуры.Номенклатура, БИТ_УдостоверенияНоменклатуры.Серия) В
    |			(ВЫБРАТЬ
    |				Остатки.Номенклатура КАК Номенклатура,
    |				Остатки.Серия КАК Серия
    |			ИЗ
    |				Остатки КАК Остатки)
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	Остатки.Номенклатура КАК Номенклатура,
    |	Остатки.Серия КАК Серия,
    |	Остатки.Склад КАК Склад,
    |	Остатки.КоличествоОстаток КАК ОстатокНаСкладе,
    |	ВТ_Карантин.КоличествоОстаток КАК ОстатокНаКарантине,
    |	ВТ_Сертификация.КоличествоОстаток КАК Сертифицировано,
    |	ВТ_Отказ.КоличествоОстаток КАК Отказ,
    |	ВТ_Удотоверения.УдостоверениеКачества КАК УдостоверениеКачества,
    |	Остатки.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры
    |ПОМЕСТИТЬ ВТ_БезЕдИзм
    |ИЗ
    |	Остатки КАК Остатки
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Карантин КАК ВТ_Карантин
    |		ПО Остатки.Номенклатура = ВТ_Карантин.Номенклатура
    |			И Остатки.Серия = ВТ_Карантин.Серия
    |			И Остатки.Склад = ВТ_Карантин.Склад
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Сертификация КАК ВТ_Сертификация
    |		ПО Остатки.Номенклатура = ВТ_Сертификация.Номенклатура
    |			И Остатки.Серия = ВТ_Сертификация.Серия
    |			И Остатки.Склад = ВТ_Сертификация.Склад
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Отказ КАК ВТ_Отказ
    |		ПО Остатки.Номенклатура = ВТ_Отказ.Номенклатура
    |			И Остатки.Серия = ВТ_Отказ.Серия
    |			И Остатки.Склад = ВТ_Отказ.Склад
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Удотоверения КАК ВТ_Удотоверения
    |		ПО Остатки.Номенклатура = ВТ_Удотоверения.Номенклатура
    |			И Остатки.Серия = ВТ_Удотоверения.Серия
    |ГДЕ
    |	Остатки.Номенклатура.ВидНоменклатуры = &ВидНоменклатуры
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	МАКСИМУМ(УпаковкиЕдиницыИзмерения.Числитель / ВЫБОР
    |			КОГДА УпаковкиЕдиницыИзмерения.Знаменатель = 0
    |				ТОГДА 1
    |			ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1)
    |		КОНЕЦ) КАК БазовыеЕдиницыИзмерения,
    |	УпаковкиЕдиницыИзмерения.Владелец КАК Владелец
    |ПОМЕСТИТЬ ВТ_ЕдИзм
    |ИЗ
    |	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
    |ГДЕ
    |	ВЫРАЗИТЬ(УпаковкиЕдиницыИзмерения.Владелец КАК Справочник.Номенклатура) В
    |			(ВЫБРАТЬ
    |				ВТ_БезЕдИзм.Номенклатура КАК Номенклатура
    |			ИЗ
    |				ВТ_БезЕдИзм КАК ВТ_БезЕдИзм)
    |
    |СГРУППИРОВАТЬ ПО
    |	УпаковкиЕдиницыИзмерения.Владелец
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	ВТ_ЕдИзм.БазовыеЕдиницыИзмерения КАК БазовыеЕдиницыИзмерения,
    |	ВТ_ЕдИзм.Владелец КАК Владелец,
    |	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка
    |ПОМЕСТИТЬ ВТ_ЕдИзмПолная
    |ИЗ
    |	ВТ_ЕдИзм КАК ВТ_ЕдИзм
    |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
    |		ПО ВТ_ЕдИзм.Владелец = УпаковкиЕдиницыИзмерения.Владелец
    |			И (ВТ_ЕдИзм.БазовыеЕдиницыИзмерения = УпаковкиЕдиницыИзмерения.Числитель / ВЫБОР
    |				КОГДА УпаковкиЕдиницыИзмерения.Знаменатель = 0
    |					ТОГДА 1
    |				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1)
    |			КОНЕЦ)
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	ВТ_БезЕдИзм.Номенклатура КАК Номенклатура,
    |	ВТ_БезЕдИзм.Серия КАК Серия,
    |	ВТ_БезЕдИзм.Склад КАК Склад,
    |	ВТ_БезЕдИзм.ОстатокНаСкладе КАК ОстатокНаСкладе,
    |	ВТ_БезЕдИзм.ОстатокНаКарантине КАК ОстатокНаКарантине,
    |	ВТ_БезЕдИзм.Сертифицировано КАК Сертифицировано,
    |	ВТ_БезЕдИзм.Отказ КАК Отказ,
    |	ВТ_БезЕдИзм.УдостоверениеКачества КАК УдостоверениеКачества,
    |	ВТ_БезЕдИзм.ВидНоменклатуры КАК ВидНоменклатуры,
    |	ВТ_БезЕдИзм.Сертифицировано / ВТ_ЕдИзмПолная.БазовыеЕдиницыИзмерения КАК СертифицированоВПалетах,
    |	ВТ_ЕдИзмПолная.Ссылка КАК ЕдИзм,
    |	ВТ_БезЕдИзм.Номенклатура.Артикул КАК Артикул,
    |	ВЫБОР
    |		КОГДА ВТ_БезЕдИзм.Сертифицировано > 0
    |			ТОГДА 1
    |		ИНАЧЕ 0
    |	КОНЕЦ КАК ПризнакСертификации,
    |	ВТ_БезЕдИзм.ОстатокНаСкладе / ВТ_ЕдИзмПолная.БазовыеЕдиницыИзмерения КАК ОстатокВПалетах,
    |	ВТ_БезЕдИзм.ОстатокНаКарантине / ВТ_ЕдИзмПолная.БазовыеЕдиницыИзмерения КАК КарантинВПалетах
    |ИЗ
    |	ВТ_БезЕдИзм КАК ВТ_БезЕдИзм
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕдИзмПолная КАК ВТ_ЕдИзмПолная
    |		ПО ВТ_БезЕдИзм.Номенклатура = ВТ_ЕдИзмПолная.Владелец
    |
    |УПОРЯДОЧИТЬ ПО
    |	Артикул";
    
    Запрос.УстановитьПараметр("Организация", Объект.Организация);
    Запрос.УстановитьПараметр("Склады", Объект.Склады.Выгрузить(,"Склад").ВыгрузитьКолонку("Склад"));
    Если ЗначениеЗаполнено(ОтборВидНоменклатуры) Тогда 
        Запрос.УстановитьПараметр("ВидНоменклатуры", ОтборВидНоменклатуры);
    Иначе
        Запрос.Текст = СтрЗаменить(Запрос.Текст,"Остатки.Номенклатура.ВидНоменклатуры = &ВидНоменклатуры", "Истина");
    КонецЕсли;
    Если НЕ ЗначениеЗаполнено(Объект.Дата) Тогда
        Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Дата","");
    Иначе
        Запрос.УстановитьПараметр("Дата", Объект.Дата);
    КонецЕсли;
    Объект.СертификацияНоменклатуры.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ОтборВТЗ = Перечисления.БИТ_ОтборВАРМКонтрольКачества.ВыводитьВсе;
    Элементы.СертификацияНоменклатурыСклад.Видимость = Ложь;
    Элементы.СертификацияНоменклатурыУдостоверениеКачества.Видимость = Ложь;
КонецПроцедуры


&НаКлиенте
Процедура ОтборПриИзменении(Элемент)
    ОтборВТЗНаСервере();
КонецПроцедуры

Процедура ОтборВТЗНаСервере()
    ЗаполнитьТЧ();
    ПостроительЗапр = Новый ПостроительЗапроса;
    ПостроительЗапр.ИсточникДанных = Новый ОписаниеИсточникаДанных(Объект.СертификацияНоменклатуры.Выгрузить());
    Если ОтборВТЗ = Перечисления.БИТ_ОтборВАРМКонтрольКачества.Карантин Тогда 
        т_Отбор = ПостроительЗапр.Отбор.Добавить("ОстатокНаКарантине");
        т_Отбор.ВидСравнения = ВидСравнения.Больше;
        т_Отбор.Значение = 0;
        т_Отбор.Использование = Истина;
        ПостроительЗапр.Выполнить();
        Объект.СертификацияНоменклатуры.Загрузить(ПостроительЗапр.Результат.Выгрузить());
    ИначеЕсли ОтборВТЗ = Перечисления.БИТ_ОтборВАРМКонтрольКачества.Выпуск Тогда
        т_Отбор = ПостроительЗапр.Отбор.Добавить("ОстатокНаКарантине");
        т_Отбор.ВидСравнения = ВидСравнения.Равно;
        т_Отбор.Значение = 0;
        т_Отбор.Использование = Истина;
        ПостроительЗапр.Выполнить();
        Объект.СертификацияНоменклатуры.Загрузить(ПостроительЗапр.Результат.Выгрузить());
    ИначеЕсли ОтборВТЗ = Перечисления.БИТ_ОтборВАРМКонтрольКачества.Отказ Тогда
        т_Отбор = ПостроительЗапр.Отбор.Добавить("Отказ");
        т_Отбор.ВидСравнения = ВидСравнения.Больше;
        т_Отбор.Значение = 0;
        т_Отбор.Использование = Истина;
        ПостроительЗапр.Выполнить();
        Объект.СертификацияНоменклатуры.Загрузить(ПостроительЗапр.Результат.Выгрузить());
    ИначеЕсли ОтборВТЗ = Перечисления.БИТ_ОтборВАРМКонтрольКачества.ВыводитьВсе Тогда
        ЗаполнитьТЧ();
    КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура СкрытьПоказатьКолонкуСклад()
    Если Объект.Склады.Количество()= 1 Тогда	
        Элементы.СертификацияНоменклатурыСклад.Видимость = Ложь;
    Иначе
        Элементы.СертификацияНоменклатурыСклад.Видимость = Истина;
    КонецЕсли;
Конецпроцедуры

&НаКлиенте
Процедура СкладыПриИзменении(Элемент)
    ЗаполнитьТЧ();
    ОтборВТЗНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
    ЗаполнитьТЧ();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьУдостоверениеКачества(Команда)
    Для каждого стр из Объект.СертификацияНоменклатуры Цикл
        Если стр.Выб И не ЗначениеЗаполнено(стр.УдостоверениеКачества)Тогда
            СтруктураЗаполнения = Новый Структура;
            СтруктураЗаполнения.Вставить("Номенклатура",стр.Номенклатура);
            СтруктураЗаполнения.Вставить("Серия",стр.Серия);
            СтруктураЗаполнения.Вставить("Организация",Объект.Организация);
            ПараметрыФормы = Новый Структура("Основание", СтруктураЗаполнения);
            ОткрытьФорму("Документ.БИТ_УдостоверениеКачества.Форма.ФормаДокумента",ПараметрыФормы,,Новый УникальныйИдентификатор());
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры


&НаСервере
Процедура ПоказыватьУдостоверенияПриИзмененииНаСервере()
    Если ПоказыватьУдостоверения Тогда 
        Элементы.СертификацияНоменклатурыУдостоверениеКачества.Видимость = Истина;
    Иначе 
        Элементы.СертификацияНоменклатурыУдостоверениеКачества.Видимость = Ложь;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьУдостоверенияПриИзменении(Элемент)
    ПоказыватьУдостоверенияПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура СертификацияНоменклатурыУдостоверениеКачестваНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    СтандартнаяОбработка = Ложь;
    Возврат;
КонецПроцедуры


&НаКлиенте
Процедура ОтборВидНоменклатурыПриИзменении(Элемент)
    ЗаполнитьТЧ();
    ОтборВТЗНаСервере();
КонецПроцедуры
